## Introduction
<p><img src="https://hope1032.com.au/wp-content/uploads/2019/04/Lego-Movie-2-3-2.jpg" alt="A picture of Lego characters!" ></p>
<h3 id="letslookatlegosets">Let's look at Lego sets!</h3>
<p>Lego is a household name across the world, supported by a diverse toy line, hit movies, and a series of successful video games. In this project, we are going to explore a key development in the history of Lego: the introduction of licensed sets such as Star Wars, Super Heroes, and Harry Potter.</p>
<p>It may not be widely known, but Lego has had its share of ups and downs since its inception in the early 20th century. This includes a particularly rough period in the late 90s. As described in <a href="https://www.businessinsider.com/how-lego-made-a-huge-turnaround-2014-2?r=US&IR=T">this article</a>, Lego was only able to survive due to a successful internal brand (Bionicle) and the introduction of its first licensed series: Star Wars. In the instructions panel are the two questions you will need to answer to complete this project.</p>
<p>Before diving into our analysis though, let's become familiar with the two datasets that will help you with this project:<br><br></p>
<div style="background-color: #ebf4f7; color: #595959; text-align:left; vertical-align: middle; padding: 15px 25px 15px 25px; line-height: 1.6;">
    <div style="font-size:20px"><b>datasets/lego_sets.csv</b></div>
<ul>
    <li><b>set_num:</b> A code that is unique to each set in the dataset. <b><i>This column is critical, and a missing value indicates the set is a duplicate or invalid!</i></b></li>
    <li><b>set_name:</b> A name for every set in the dataset (note that this can be the same for different sets).</li>
    <li><b>year:</b> The date the set was released.</li>
    <li><b>num_parts:</b> The number of parts contained in the set.<b><i> This column is not central to our analyses, so missing values are acceptable.</i></b></li>
        <li><b>theme_name:</b> The name of the sub-theme of the set.</li>
    <li><b>parent_theme:</b> The name of the parent theme the set belongs to. Matches the `name` column of the `parent_themes` csv file.</li>
</ul>

<div style="font-size:20px"><b>datasets/parent_themes.csv</b></div>
<ul>
    <li><b>id:</b> A code that is unique to every theme.</li>
    <li><b>name:</b> The name of the parent theme.</li>
    <li><b>is_licensed:</b> A Boolean column specifying whether the theme is a licensed theme.</li>
</ul>
    </div>
<p>From here on out, it will be our task to explore and manipulate the existing data until we are able to answer the two questions described in the instructions panel. Feel free to add as many cells as necessary.</p>

In [25]:
#Importing import libraries and data 
import pandas as pd
import numpy as np

df = pd.read_csv('https://raw.githubusercontent.com/mrblink2002/Lego_Data_Analytics/main/datasets/lego_sets.csv')
parent_theme = pd.read_csv('https://raw.githubusercontent.com/mrblink2002/Lego_Data_Analytics/main/datasets/parent_themes.csv')

In [26]:
#Examing the lego set
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [27]:
#Examing the Parent Theme
parent_theme.head()

    id     name  is_licensed
0    1  Technic        False
1   22  Creator        False
2   50     Town        False
3  112   Racers        False
4  126    Space        False

In [28]:
#Understanding the Memory Usage
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11986 entries, 0 to 11985
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   set_num       11833 non-null  object
 1   name          11833 non-null  object
 2   year          11986 non-null  int64
 3   num_parts     6926 non-null   float64
 4   theme_name    11833 non-null  object
 5   parent_theme  11986 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 562.0+ KB

In [29]:
parent_theme.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           111 non-null    int64
 1   name         111 non-null    object
 2   is_licensed  111 non-null    bool
dtypes: bool(1), int64(1), object(1)
memory usage: 2.0+ KB

In [30]:
#Exploring Lego Set Dataset
df.describe()

               year    num_parts
count  11986.000000  6926.000000
mean    2002.304772   163.782558
std       13.471680   334.206873
min     1950.000000    -1.000000
25%     1997.000000    10.250000
50%     2006.000000    46.000000
75%     2013.000000   173.000000
max     2017.000000  5922.000000

In [31]:
df.dtypes

set_num          object
name             object
year              int64
num_parts       float64
theme_name       object
parent_theme     object
dtype: object

In [32]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [33]:
df.dtypes

set_num          object
name             object
year              int64
num_parts       float64
theme_name       object
parent_theme     object
dtype: object

In [35]:
#Inspecting the Unique Values
df.set_num.unique()

array(['00-1', '0011-2', '0011-3', ..., 'WishingWell-1', 'wwgp1-1', nan],
      dtype=object)

In [36]:
df["set_num"].value_counts()

00-1       1
720-1      1
7191-1     1
7194-1     1
7195-1     1
          ..
4267-1     1
427-1      1
4271-1     1
4274-1     1
wwgp1-1    1
Name: set_num, Length: 11833, dtype: int64

In [37]:
#looking for missing Values`    `
df["set_num"].isna().sum()

153

In [43]:
# Making Three Different Columns for Different Values                       
df[["Set","Number","Sub-Number"]] = df['set_num'].fillna(value = "None-None").str.split('-',expand=True)

In [44]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme,Set,Number,Sub-Number
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,0011,2,None
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,0011,3,None
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0012,1,None
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0013,1,None

In [45]:
df.columns = [x.lower().replace('-','') for x in df.columns]

In [46]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme,set,number,subnumber
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,0011,2,None
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,0011,3,None
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0012,1,None
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0013,1,None